<template>
  <div class="privacyPage">
    <div class="columns p-4 mt-8 mb-32 sm:px-4">
      <article class="col-span-8 col-start-3 md:col-start-1 sm:col-span-4">
        <h1>隱私權宣告</h1>
        <div class="w-full text-right pt-4">公告日期：<time>2024-12-10</time></div>
        <p>感謝您蒞臨<span
            class="text-primary font-semibold pl-1">熊途</span>（以下稱本網站），為了讓您能夠安心的使用本網站的各項服務與資訊，特此向您說明本網站的隱私權保護政策，以保障您的權益，請您詳閱下列內容：
        </p>
        <h2>壹、適用範圍</h2>
        <p>一、本網站「隱私權宣告」適用於您在瀏覽使用本網站及使用的服務，所涉及之個人資料蒐集、處理與利用行為。</p>
        <p>二、凡經由本網站連結至第三方獨立管理、經營之網站，有關個人資料的保護，適用第三方或各該網站的隱私權政策，本網站不負任何連帶責任。</p>
        <h2>貳、個人資料之蒐集、處理及利用</h2>
        <p>一、當您在使用本網站所提供的各類服務時，我們將視業務性質請您提供必要的個人資料，並會遵循「個人資料保護法」及相關法令規定，在該特定目的範圍內處理及利用您的個人資料。</p>
        <p>二、您的個人資料在處理過程中，本系統將遵守相關之流程及內部作業規範，並依據資訊安全之要求，進行必要之人員控管。</p>
        <p>三、本網站所提供的各類服務項目，因服務需要而請您提供姓名、電子信箱等個人資料時，您可自由選擇是否提供之個人資料，如不提供或資料錯誤，則無法為您提供相關服務。</p>
        <h2>參、與第三人共用個人資料</h2>
        <p>一、本網站不會提供、交換、出租或出售任何您的個人資料給其他個人、團體、私人企業或公務機關，但有法律依據或合約義務者，不在此限。</p>
        <p>二、前項但書之情形包括不限於</p>
        <ol>
          <li>配合司法單位合法的調查。</li>
          <li>配合主管機關依職權或職務需要之調查或使用。</li>
          <li>基於善意相信揭露您的個人資料為法律所必需。</li>
          <li>當您在本網站的行為，違反本網站的服務條款或可能損害或妨礙本網站權益或導致任何人遭受損害時，經本網站研析揭露您的個人資料是為了辨識、聯絡或採取法律行動所必要者。</li>
        </ol>
        <h2>肆、當事人得行使之權利及方式</h2>
        <p>您可以依「個人資料保護法」第三條規定行使當事人相關權利，可利用電子信箱提出申請，以查詢、閱覽、製給複製本；或補充、更正、請求停止蒐集、處理、利用或刪除個人資料內容。</p>
        <h2>伍、用戶資料安全保護政策之諮詢與申訴</h2>
        <p>使用者若對本網站個人資料管理相關事項有任何疑慮，可利用本網站電子信箱與本網站統聯絡，我們將提供完整的說明。<br>電子信箱：<a
            href="mailto:bearune.official@gmail.com">bearune.official@gmail.com</a></p>
        <h2>陸、Cookie之運用</h2>
        <p>基於網站內部管理之需要及提供最佳個人化服務，本網站將在您的瀏覽器中寫入Cookies並讀取記錄瀏覽者的網站會員帳戶資訊。<br>若您不願接受 Cookies 的寫入，您可將使用中之瀏覽器設定為拒絕
          Cookies 的寫入，但也因此會使網站某些功能無法正常執行。</p>
        <h2>柒、伺服器紀錄</h2>
        <p>
          當您透過瀏覽器使用本網站時，我們的伺服器會自動記錄特定的技術性資訊。這些伺服器紀錄可能包含您的網頁要求、網際網路通訊協定位址、瀏覽器類型、送出要求的日期和時間等資訊，並僅對全體使用者行為總和進行分析，以做為增進網站服務的參考依據。
        </p>
        <h2>捌、隱私權宣告之修改</h2>
        <p>本隱私權宣告將適時依據法律修正、相關技術之發展及內部管理制度之調整而配合修改，以落實保障您隱私權及網路安全之初衷。當本網站完成相關條款修改時，會立即將其刊登於本網站中，並以醒目標示提醒您前往點選閱讀。
        </p>
      </article>
    </div>
  </div>
</template>

<script setup>
</script>

<style lang="scss" scoped>
// .privacyPage {
//   h1 {
//     @apply font-semibold text-3xl sm:text-2xl;
//   }

//   h2 {
//     @apply pt-16 font-medium text-xl;
//   }

//   p {
//     @apply pt-4;
//   }

//   ol {
//     @apply list-decimal pl-14 pt-4;

//     li {
//       @apply pl-2;
//     }
//   }
// }</style>